import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { ArrowIconComponent } from "../arrow-icon/arrow-icon.component";
import { SubHeadingComponent } from "../sub-heading/sub-heading.component";
import { ParagraphComponent } from "../paragraph/paragraph.component";

interface Slide {
  bg: string;
  img1: string;
  img2: string;
  heading: string;
  paragraphs: string[];
}

@Component({
  selector: 'app-seasons-slider',
  standalone: true,
  imports: [
    CommonModule,
    ArrowIconComponent,
    SubHeadingComponent,
    ParagraphComponent
  ],
  templateUrl: './seasons-slider.component.html',
  styleUrl: './seasons-slider.component.scss'
})
export class SeasonsSliderComponent {
  slides: Slide[] = [
    {
      bg: '/assets/images/seasons/autumn/bg.webp',
      img1: '/assets/images/seasons/autumn/1.webp',
      img2: '/assets/images/seasons/autumn/2.webp',
      heading: 'Осінь часто називають золотою',
      paragraphs: [
        'Чому, здогадатися неважко: листя на деревах із зеленого перефарбовується в різні відтінки золотого. Жовта охра, червона мідь, зеленувата латунь, коричнева бронза, блідо-жовте і оранжево-жовте золото — всі ці кольори насамперед нагадують про осінь. Подивишся на Рахівські ліси, які всі пофарбовані у такі відтінки, й мимоволі подумаєш: так, золота осінь. Це дуже красива пора, можливо, найкрасивіша в році. У всякому разі, багато художників особливо люблять писати саме осінні пейзажі. Ця тема дає їм найбагатший вибір фарб',
        'Піднімаючись з міста РАХІВ на нашу полонину РОЗА ВІТРІВ ви одразу на початку маршруту (піший чи автомобільний) будете приємно здивовані "Золотими велетнями " гордістю міста РАХІВ та України , адже перші дерева на маршруті це найбільші та найстаріші Модрини у європі які прикрашають своїм золотим вбранням лісопарк Буркут. Піднімаючись далі ви побачите ясені білоцвіт ЧКУ які весною радували своїм пахучим цвітом а зараз не менш гарні тому що квіти перевтілились у яскраво червоні немов ліхтарики оберемки насіння. Також гарно зацвітають осінніми барвами вздовж дороги Граби, Буки, Дуби, Ліщина, Вільха, Акація, Клени, Берези, Бузина біла та червона, чорна та червона Горобина, Калина, Шипшина, Осика, Черешні, Груші, Яблуні, Сливи, Кізил, лише вічнозелені Смереки та Сосни не зміняюють свого вічнозеленого вбрання...',
        'Осіння пора щедро ділиться своїми дарами , можна на маршруті розбирати грецьких горіхів, ліщини, яблук та груш, малини, ожини, чорниці та брусниці, багаті наші мішані ліси також і грибами. Золота осінь тут триває довго , в осінні барви гірські ліси одягаються поступово від міста до вершини цей процес рухається повільно. На полонині щодня пасеться велика отара овець яка зачаровує своєю музикою дзвінків на фоні найвищих вершин Українських Карпат...',
        'Осінніми прохолодними вечорами зігрітися можна в сауні та чані на полонині з найгарнішою панорамою'
      ],
    },
    {
      bg: '/assets/images/seasons/spring/bg.webp',
      img1: '/assets/images/seasons/spring/1.webp',
      img2: '/assets/images/seasons/spring/2.webp',
      heading: 'Весна у Карпатах ',
      paragraphs: [
        '– це чудова пора коли природа просипається мов від сну, а все навколо стає неймовірно квітучими і прекрасним. Спостерігати за такими природними метаморфозами – саме задоволення. Ви можете дихати чистим повітрям, і насолоджуватись спокоєм. Відпочинок на нашій полонині навесні подарить масу приємних вражень і можливостей – туристів з кожним роком піднімається все більше щоб побачити як оживає природа в горах як пливуть хмаринки за небокрай після весняних опадів, як пробиваються підсніжники, крокуси та інші первоцвіти крізь залишки снігу до теплого весняного сонечка, як дзюрконять струмочки з залишків зимових наметів',
        `Народжується нове життя на полонині, за вівцями вже бігають маленькі ягнята які плекаются материнським молоком під теплим весняним сонцем. Прекрасні місця, від яких неможливо відвести погляд, земля пробуджується під теплим сонячним промінням і дарує життя всьому навколо. Що можете бути кращим за прогулянки весняним лісом на високогір'ї та квітучими полонинами, під ногами починає зеленіти а кругом вершини трьох найбільших масивів Українських Карпат вкриті сніговим покривом, це видовище неймовірне, хто вперше підіймається весною на цю панорамну полонину не вірить своїм очам здається що це Австрія чи Швейцарія із засніженими вершинами, а поруч зелена травичка на якій вже пасуться овечки`,
      ],
    },
    {
      bg: '/assets/images/seasons/summer/bg.webp',
      img1: '/assets/images/seasons/summer/1.webp',
      img2: '/assets/images/seasons/summer/2.webp',
      heading: 'Літо в Карпатах',
      paragraphs: [
        `Провести літо в Карпатах — це мрія для багатьох, найголовніше, що вона легко здійсненна. Літо в Карпатах — це прекрасна можливість познайомитися з чарівним світом гір, відмінно відпочити і набратися сил. Головне, щоб ваше літо принесло море вражень на цілий рік. Справжнє літо в Карпатах досить коротке, воно настає трохи пізніше календарного літа. Травневі гори ще частково вкриті снігом, весна починає підкорювати гори з приходом червня. Хоча високі гори навіть червневими ночами можуть здивувати заморозки, коли тільки починають повноцінно оживати після зими дерева і трави на високогір'ї`,
        `Ближче до середині червня гори підкорює літо, це час, коли Карпати цвітуть — густо вкриті рододендроном гори забарвлюють червоні тони. Це чарівне видовище — стояти на вершині гори, занурившись в яскраві фарби гірських квітів, ніби ви потрапили на зйомку фільму — це літо в горах.`,
        `Але навіть в кінці липня гори можуть здивувати снігом, для Чорногори та мармаросів це не рідкісне явище, в ущелинах мармаросів льодовик може продовжувати таяти до осені`,
        `З приходом липня літо вже остаточно обґрунтовується в Карпатах. Гори радують ягодами чорниці, брусниці, малини і ожини, після дощу вже можна збирати білі гриби і лисички. Ягідний бум припадає на середину літа, поступово стихаючи ближче до кінця вересня, але продовжують радувати гриби, які часто стають основною стравою для бувалих туристів`,
        `Серпень зазвичай теплий, але друга половина цього місяця іноді засмучує дощами і прохолодним повітрям, коротке літо в Карпатах добігає кінця. Серпневими вечорами температура повітря може опускатися нижче +15 і вітри стають прохолоднішими`,
        `Ближче до кінця серпня ви зможете насолодитися тривалими прогулянками карпатським лісом, тестуючи гумові чоботи і вишукуючи гриби, або ягоди. Літо як і інші пори року на полонині РОЗА ВІТРІВ незабутні. Сюди захочеться повертатись знову і знову...`,
      ],
    },
    {
      bg: '/assets/images/seasons/winter/bg.webp',
      img1: '/assets/images/seasons/winter/1.webp',
      img2: '/assets/images/seasons/winter/2.webp',
      heading: 'Коли приходить зима в Карпати',
      paragraphs: [
        `приходить час активного зимового відпочинку, піднявшись взимку на полонину РОЗА ВІТРІВ ви можете покататися на лижах, сноуборді чи тюбінгах, витяг 250 метрів. Після катання можна попаритись в сауні чи чані з видом на всі найвищі вершини Українських Карпат`
      ],
    },
  ];
  currentSlideIndex = 0;
  isVisible = true;

  nextSlide(): void {
    this.animateSlideChange(() => {
      this.currentSlideIndex = (this.currentSlideIndex + 1) % this.slides.length;
    });
  }

  prevSlide(): void {
    this.animateSlideChange(() => {
      this.currentSlideIndex = (this.currentSlideIndex - 1 + this.slides.length) % this.slides.length;
    });
  }

  private animateSlideChange(callback: () => void): void {
    this.isVisible = false;
    setTimeout(() => {
      callback();
      this.isVisible = true;
    }, 500);
  }
}
